Update documentation for developer control plane
